{
    "word_to_index": {
        "<pad>": 0,
        "<unk>": 1,
        "<eos>": 2,
        "de": 3,
        "el": 4,
        "con": 5,
        "en": 6,
        "concepto": 7,
        "es": 8,
        "un": 9,
        "la": 10,
        "que": 11,
        "y": 12,
        "a": 13,
        "para": 14,
        "datos": 15,
        "ayuda": 16,
        "aparece": 17,
        "resultado": 18,
        "estudiar": 19,
        "resolver": 20,
        "matematicas": 21,
        "importante": 22,
        "ademas": 23,
        "entender": 24,
        "conviene": 25,
        "ejemplos": 26,
        "sencillos": 27,
        "ejercicio": 28,
        "requiere": 29,
        "identificar": 30,
        "operaciones": 31,
        "idea": 32,
        "tema": 33,
        "si": 34,
        "problema": 35,
        "menciona": 36,
        "hay": 37,
        "leer": 38,
        "cuidado": 39,
        "enunciado": 40,
        "explicar": 41,
        "palabras": 42,
        "claras": 43,
        "problemas": 44,
        "una": 45,
        "ecuacion": 46,
        "probabilidad": 47,
        "lineal": 48,
        "funcion": 49,
        "derivada": 50,
        "espacio": 51,
        "comun": 52,
        "variable": 53,
        "suma": 54,
        "mide": 55,
        "pregunta": 56,
        "respuesta": 57,
        "valor": 58,
        "matrices": 59,
        "aritmetica": 60,
        "algebra": 61,
        "calculo": 62,
        "estadistica": 63,
        "media": 64,
        "multiplicacion": 65,
        "tiene": 66,
        "puede": 67,
        "polinomio": 68,
        "limite": 69,
        "vector": 70,
        "matriz": 71,
        "suceso": 72,
        "resta": 73,
        "division": 74,
        "fraccion": 75,
        "base": 76,
        "integral": 77,
        "varianza": 78,
        "numero": 79,
        "divisor": 80,
        "multiplo": 81,
        "ecuaciones": 82,
        "sucesion": 83,
        "producto": 84,
        "independencia": 85,
        "autovalor": 86,
        "autovector": 87,
        "muestral": 88,
        "potencia": 89,
        "raiz": 90,
        "cuadrada": 91,
        "primo": 92,
        "maximo": 93,
        "minimo": 94,
        "absoluto": 95,
        "porcentaje": 96,
        "cuadratica": 97,
        "discriminante": 98,
        "monomio": 99,
        "factorizacion": 100,
        "identidad": 101,
        "algebraica": 102,
        "sistema": 103,
        "inecuacion": 104,
        "racional": 105,
        "continuidad": 106,
        "segunda": 107,
        "regla": 108,
        "cadena": 109,
        "primitiva": 110,
        "serie": 111,
        "taylor": 112,
        "diferencial": 113,
        "vectorial": 114,
        "subespacio": 115,
        "dimension": 116,
        "determinante": 117,
        "rango": 118,
        "escalar": 119,
        "norma": 120,
        "condicionada": 121,
        "bayes": 122,
        "aleatoria": 123,
        "esperanza": 124,
        "mediana": 125,
        "regresion": 126,
        "representa": 127,
        "usa": 128,
        "dos": 129,
        "numeros": 130,
        "contiene": 131,
        "o": 132,
        "cantidades": 133,
        "cantidad": 134,
        "se": 135,
        "produce": 136,
        "repetida": 137,
        "partes": 138,
        "su": 139,
        "uno": 140,
        "sirve": 141,
        "cero": 142,
        "igualdad": 143,
        "valores": 144,
        "grado": 145,
        "tener": 146,
        "estudia": 147,
        "ser": 148,
        "asigna": 149,
        "derivadas": 150,
        "direccion": 151,
        "vectores": 152,
        "por": 153,
        "informacion": 154,
        "entre": 155,
        "resume": 156,
        "combina": 157,
        "calcula": 158,
        "diferencia": 159,
        "reparte": 160,
        "cociente": 161,
        "unidad": 162,
        "busca": 163,
        "simplificar": 164,
        "fracciones": 165,
        "distancia": 166,
        "al": 167,
        "siempre": 168,
        "no": 169,
        "expresa": 170,
        "sobre": 171,
        "desconocida": 172,
        "incognitas": 173,
        "recta": 174,
        "soluciones": 175,
        "monomios": 176,
        "parte": 177,
        "expresiones": 178,
        "como": 179,
        "polinomios": 180,
        "dominio": 181,
        "cada": 182,
        "entrada": 183,
        "unica": 184,
        "salida": 185,
        "comportamiento": 186,
        "cerca": 187,
        "punto": 188,
        "significa": 189,
        "relaciona": 190,
        "cambio": 191,
        "instantaneo": 192,
        "acumulacion": 193,
        "area": 194,
        "orientada": 195,
        "funciones": 196,
        "sentido": 197,
        "modulo": 198,
        "permite": 199,
        "escalares": 200,
        "del": 201,
        "tabla": 202,
        "filas": 203,
        "columnas": 204,
        "relacion": 205,
        "posibilidad": 206,
        "resultados": 207,
        "cambia": 208,
        "dispersion": 209,
        "respecto": 210,
        "central": 211,
        "extremos": 212,
        "compara": 213,
        "factores": 214,
        "numerador": 215,
        "denominador": 216,
        "exponente": 217,
        "cuadrado": 218,
        "radicando": 219,
        "exactamente": 220,
        "divisores": 221,
        "positivos": 222,
        "mismo": 223,
        "mayor": 224,
        "menor": 225,
        "positivo": 226,
        "sumar": 227,
        "negativo": 228,
        "proporcion": 229,
        "cien": 230,
        "comparar": 231,
        "cambiar": 232,
        "resuelve": 233,
        "buscando": 234,
        "grafica": 235,
        "reales": 236,
        "cuadraticas": 237,
        "depende": 238,
        "los": 239,
        "coeficientes": 240,
        "coeficiente": 241,
        "literal": 242,
        "forma": 243,
        "escribe": 244,
        "productos": 245,
        "verdadera": 246,
        "transformar": 247,
        "varias": 248,
        "comunes": 249,
        "desigualdad": 250,
        "solucion": 251,
        "suele": 252,
        "intervalo": 253,
        "restricciones": 254,
        "e": 255,
        "imagen": 256,
        "existir": 257,
        "sin": 258,
        "ausencia": 259,
        "saltos": 260,
        "interpreta": 261,
        "pendiente": 262,
        "local": 263,
        "curvatura": 264,
        "concavidad": 265,
        "deriva": 266,
        "composiciones": 267,
        "multiplica": 268,
        "encadenadas": 269,
        "representar": 270,
        "cuya": 271,
        "otra": 272,
        "integrales": 273,
        "indefinidas": 274,
        "lista": 275,
        "ordenada": 276,
        "converger": 277,
        "terminos": 278,
        "convergente": 279,
        "divergente": 280,
        "aproxima": 281,
        "sucesivas": 282,
        "describe": 283,
        "cambios": 284,
        "dinamicos": 285,
        "representarse": 286,
        "coordenadas": 287,
        "cerrado": 288,
        "genera": 289,
        "todo": 290,
        "independientes": 291,
        "cuenta": 292,
        "tamano": 293,
        "algebraico": 294,
        "da": 295,
        "cuadradas": 296,
        "indica": 297,
        "invertibilidad": 298,
        "sistemas": 299,
        "escala": 300,
        "diagonalizacion": 301,
        "mantiene": 302,
        "bajo": 303,
        "asocia": 304,
        "angular": 305,
        "detecta": 306,
        "ortogonalidad": 307,
        "longitud": 308,
        "definir": 309,
        "toma": 310,
        "posibles": 311,
        "pertenece": 312,
        "experimento": 313,
        "aleatorio": 314,
        "subconjunto": 315,
        "previa": 316,
        "universo": 317,
        "considerado": 318,
        "otro": 319,
        "simplifica": 320,
        "calculos": 321,
        "actualiza": 322,
        "probabilidades": 323,
        "nueva": 324,
        "discreta": 325,
        "continua": 326,
        "medio": 327,
        "teorico": 328,
        "distribucion": 329,
        "desviaciones": 330,
        "verse": 331,
        "afectada": 332,
        "divide": 333,
        "ordenados": 334,
        "robusta": 335,
        "ante": 336,
        "ajusta": 337,
        "modela": 338,
        "variables": 339,
        "operacion": 340,
        "iguales": 341,
        "cambiante": 342,
        "rectangular": 343,
        "mediante": 344
    },
    "index_to_word": {
        "0": "<pad>",
        "1": "<unk>",
        "2": "<eos>",
        "3": "de",
        "4": "el",
        "5": "con",
        "6": "en",
        "7": "concepto",
        "8": "es",
        "9": "un",
        "10": "la",
        "11": "que",
        "12": "y",
        "13": "a",
        "14": "para",
        "15": "datos",
        "16": "ayuda",
        "17": "aparece",
        "18": "resultado",
        "19": "estudiar",
        "20": "resolver",
        "21": "matematicas",
        "22": "importante",
        "23": "ademas",
        "24": "entender",
        "25": "conviene",
        "26": "ejemplos",
        "27": "sencillos",
        "28": "ejercicio",
        "29": "requiere",
        "30": "identificar",
        "31": "operaciones",
        "32": "idea",
        "33": "tema",
        "34": "si",
        "35": "problema",
        "36": "menciona",
        "37": "hay",
        "38": "leer",
        "39": "cuidado",
        "40": "enunciado",
        "41": "explicar",
        "42": "palabras",
        "43": "claras",
        "44": "problemas",
        "45": "una",
        "46": "ecuacion",
        "47": "probabilidad",
        "48": "lineal",
        "49": "funcion",
        "50": "derivada",
        "51": "espacio",
        "52": "comun",
        "53": "variable",
        "54": "suma",
        "55": "mide",
        "56": "pregunta",
        "57": "respuesta",
        "58": "valor",
        "59": "matrices",
        "60": "aritmetica",
        "61": "algebra",
        "62": "calculo",
        "63": "estadistica",
        "64": "media",
        "65": "multiplicacion",
        "66": "tiene",
        "67": "puede",
        "68": "polinomio",
        "69": "limite",
        "70": "vector",
        "71": "matriz",
        "72": "suceso",
        "73": "resta",
        "74": "division",
        "75": "fraccion",
        "76": "base",
        "77": "integral",
        "78": "varianza",
        "79": "numero",
        "80": "divisor",
        "81": "multiplo",
        "82": "ecuaciones",
        "83": "sucesion",
        "84": "producto",
        "85": "independencia",
        "86": "autovalor",
        "87": "autovector",
        "88": "muestral",
        "89": "potencia",
        "90": "raiz",
        "91": "cuadrada",
        "92": "primo",
        "93": "maximo",
        "94": "minimo",
        "95": "absoluto",
        "96": "porcentaje",
        "97": "cuadratica",
        "98": "discriminante",
        "99": "monomio",
        "100": "factorizacion",
        "101": "identidad",
        "102": "algebraica",
        "103": "sistema",
        "104": "inecuacion",
        "105": "racional",
        "106": "continuidad",
        "107": "segunda",
        "108": "regla",
        "109": "cadena",
        "110": "primitiva",
        "111": "serie",
        "112": "taylor",
        "113": "diferencial",
        "114": "vectorial",
        "115": "subespacio",
        "116": "dimension",
        "117": "determinante",
        "118": "rango",
        "119": "escalar",
        "120": "norma",
        "121": "condicionada",
        "122": "bayes",
        "123": "aleatoria",
        "124": "esperanza",
        "125": "mediana",
        "126": "regresion",
        "127": "representa",
        "128": "usa",
        "129": "dos",
        "130": "numeros",
        "131": "contiene",
        "132": "o",
        "133": "cantidades",
        "134": "cantidad",
        "135": "se",
        "136": "produce",
        "137": "repetida",
        "138": "partes",
        "139": "su",
        "140": "uno",
        "141": "sirve",
        "142": "cero",
        "143": "igualdad",
        "144": "valores",
        "145": "grado",
        "146": "tener",
        "147": "estudia",
        "148": "ser",
        "149": "asigna",
        "150": "derivadas",
        "151": "direccion",
        "152": "vectores",
        "153": "por",
        "154": "informacion",
        "155": "entre",
        "156": "resume",
        "157": "combina",
        "158": "calcula",
        "159": "diferencia",
        "160": "reparte",
        "161": "cociente",
        "162": "unidad",
        "163": "busca",
        "164": "simplificar",
        "165": "fracciones",
        "166": "distancia",
        "167": "al",
        "168": "siempre",
        "169": "no",
        "170": "expresa",
        "171": "sobre",
        "172": "desconocida",
        "173": "incognitas",
        "174": "recta",
        "175": "soluciones",
        "176": "monomios",
        "177": "parte",
        "178": "expresiones",
        "179": "como",
        "180": "polinomios",
        "181": "dominio",
        "182": "cada",
        "183": "entrada",
        "184": "unica",
        "185": "salida",
        "186": "comportamiento",
        "187": "cerca",
        "188": "punto",
        "189": "significa",
        "190": "relaciona",
        "191": "cambio",
        "192": "instantaneo",
        "193": "acumulacion",
        "194": "area",
        "195": "orientada",
        "196": "funciones",
        "197": "sentido",
        "198": "modulo",
        "199": "permite",
        "200": "escalares",
        "201": "del",
        "202": "tabla",
        "203": "filas",
        "204": "columnas",
        "205": "relacion",
        "206": "posibilidad",
        "207": "resultados",
        "208": "cambia",
        "209": "dispersion",
        "210": "respecto",
        "211": "central",
        "212": "extremos",
        "213": "compara",
        "214": "factores",
        "215": "numerador",
        "216": "denominador",
        "217": "exponente",
        "218": "cuadrado",
        "219": "radicando",
        "220": "exactamente",
        "221": "divisores",
        "222": "positivos",
        "223": "mismo",
        "224": "mayor",
        "225": "menor",
        "226": "positivo",
        "227": "sumar",
        "228": "negativo",
        "229": "proporcion",
        "230": "cien",
        "231": "comparar",
        "232": "cambiar",
        "233": "resuelve",
        "234": "buscando",
        "235": "grafica",
        "236": "reales",
        "237": "cuadraticas",
        "238": "depende",
        "239": "los",
        "240": "coeficientes",
        "241": "coeficiente",
        "242": "literal",
        "243": "forma",
        "244": "escribe",
        "245": "productos",
        "246": "verdadera",
        "247": "transformar",
        "248": "varias",
        "249": "comunes",
        "250": "desigualdad",
        "251": "solucion",
        "252": "suele",
        "253": "intervalo",
        "254": "restricciones",
        "255": "e",
        "256": "imagen",
        "257": "existir",
        "258": "sin",
        "259": "ausencia",
        "260": "saltos",
        "261": "interpreta",
        "262": "pendiente",
        "263": "local",
        "264": "curvatura",
        "265": "concavidad",
        "266": "deriva",
        "267": "composiciones",
        "268": "multiplica",
        "269": "encadenadas",
        "270": "representar",
        "271": "cuya",
        "272": "otra",
        "273": "integrales",
        "274": "indefinidas",
        "275": "lista",
        "276": "ordenada",
        "277": "converger",
        "278": "terminos",
        "279": "convergente",
        "280": "divergente",
        "281": "aproxima",
        "282": "sucesivas",
        "283": "describe",
        "284": "cambios",
        "285": "dinamicos",
        "286": "representarse",
        "287": "coordenadas",
        "288": "cerrado",
        "289": "genera",
        "290": "todo",
        "291": "independientes",
        "292": "cuenta",
        "293": "tamano",
        "294": "algebraico",
        "295": "da",
        "296": "cuadradas",
        "297": "indica",
        "298": "invertibilidad",
        "299": "sistemas",
        "300": "escala",
        "301": "diagonalizacion",
        "302": "mantiene",
        "303": "bajo",
        "304": "asocia",
        "305": "angular",
        "306": "detecta",
        "307": "ortogonalidad",
        "308": "longitud",
        "309": "definir",
        "310": "toma",
        "311": "posibles",
        "312": "pertenece",
        "313": "experimento",
        "314": "aleatorio",
        "315": "subconjunto",
        "316": "previa",
        "317": "universo",
        "318": "considerado",
        "319": "otro",
        "320": "simplifica",
        "321": "calculos",
        "322": "actualiza",
        "323": "probabilidades",
        "324": "nueva",
        "325": "discreta",
        "326": "continua",
        "327": "medio",
        "328": "teorico",
        "329": "distribucion",
        "330": "desviaciones",
        "331": "verse",
        "332": "afectada",
        "333": "divide",
        "334": "ordenados",
        "335": "robusta",
        "336": "ante",
        "337": "ajusta",
        "338": "modela",
        "339": "variables",
        "340": "operacion",
        "341": "iguales",
        "342": "cambiante",
        "343": "rectangular",
        "344": "mediante"
    }
}